In [21]:
import pandas as pd
hotel= pd.read_csv("hotel_bookings.csv")
hotel.head()

,hotel,is_canceled,lead_time,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,adults,...,deposit_type,agent,company,days_in_waiting_list,customer_type,adr,required_car_parking_spaces,total_of_special_requests,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015,July,27,1,0,0,2,...,No Deposit,NaN,NaN,0,Transient,0.0,0,0,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015,July,27,1,0,1,1,...,No Deposit,NaN,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015,July,27,1,0,1,1,...,No Deposit,304.0,NaN,0,Transient,75.0,0,0,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015,July,27,1,0,2,2,...,No Deposit,240.0,NaN,0,Transient,98.0,0,1,Check-Out,2015-07-03

In [23]:
#Je více rezervací zrušeno pro městské hotely nebo pro hotely v rezortech?
pd.crosstab(index=hotel['hotel'], columns= hotel['is_canceled'],normalize="index").style.format("{:.2%}")

In [ ]:
#Pro které kategorie je více zrušených rezervací a pro které naopak více nezrušených?
hotel = hotel[hotel['hotel']=='City Hotel']
bins = [-1,7,30,180,float("inf")]
labels = ['Last-minute','Short-term','Medium-term','Long-term']
hotel['reservation_category']=pd.cut(hotel['lead_time'],bins=bins,labels=labels)
pd.crosstab(index=hotel['reservation_category'], columns= hotel['is_canceled'],normalize='index')

is_canceled                  0         1
reservation_category
Last-minute           0.877961  0.122039
Short-term            0.690935  0.309065
Medium-term           0.563147  0.436853
Long-term             0.359393  0.640607

In [13]:
#v jaké skupině je celkově nejvíce rezervací?
pd.crosstab(index=hotel['reservation_category'], columns= hotel['is_canceled'])

is_canceled               0      1
reservation_category
Last-minute            9489   1319
Short-term             8674   3880
Medium-term           21974  17046
Long-term              6091  10857

In [ ]:
#BONUS TITANIC
titanic= pd.read_csv("titanic.csv")
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
pd.crosstab(index=titanic['Pclass'], columns= titanic['Survived'])

Survived         0         1
Pclass
1         0.370370  0.629630
2         0.527174  0.472826
3         0.757637  0.242363

In [24]:
pd.crosstab(index=titanic['Pclass'], columns= titanic['Survived'],normalize='index').style.format("{:.2%}")

In [25]:
pd.crosstab(index=titanic['Sex'], columns= titanic['Survived'],normalize='index').style.format("{:.2%}")

# Halfmaraton

In [19]:
import pandas as pd
hm=pd.read_csv('half_marathon.csv')
hm.head()

            Jmeno  Rocnik       Cas  Rok zavodu
0  Aster Vladimír    1965  01:53:25        2019
1  Aster Vladimír    1965  02:00:19        2020
2   Asterová Jana    1974  02:16:59        2019
3   Asterová Jana    1974  02:30:01        2020
4   Baborová Anna    1990  01:58:20        2019

In [20]:
#Převeď sloupec s časem závodníka na typ datetime
hm['Cas'] = pd.to_datetime(hm['Cas']) 
hm['Cas 2019'] = hm['Cas'].shift(periods = 1)
hm.head()

C:\Users\Root\AppData\Local\Temp\ipykernel_14536\3251776266.py:2: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  hm['Cas'] = pd.to_datetime(hm['Cas'])

            Jmeno  Rocnik                 Cas  Rok zavodu            Cas 2019
0  Aster Vladimír    1965 2025-10-12 01:53:25        2019                 NaT
1  Aster Vladimír    1965 2025-10-12 02:00:19        2020 2025-10-12 01:53:25
2   Asterová Jana    1974 2025-10-12 02:16:59        2019 2025-10-12 02:00:19
3   Asterová Jana    1974 2025-10-12 02:30:01        2020 2025-10-12 02:16:59
4   Baborová Anna    1990 2025-10-12 01:58:20        2019 2025-10-12 02:30:01

In [21]:
hm = hm[hm['Rok zavodu']==2020]
hm.head()

,Jmeno,Rocnik,Cas,Rok zavodu,Cas 2019
1,Aster Vladimír,1965,2025-10-12 02:00:19,2020,2025-10-12 01:53:25
3,Asterová Jana,1974,2025-10-12 02:30:01,2020,2025-10-12 02:16:59
5,Baborová Anna,1990,2025-10-12 01:52:25,2020,2025-10-12 01:58:20
7,Bambas Jan,1975,2025-10-12 02:35:39,2020,2025-10-12 02:02:59
9,Barochovská Andrea,1976,2025-10-12 02:50:05,2020,2025-10-12 03:01:25

In [22]:
hm['Zmena'] = hm['Cas'] - hm['Cas 2019']
hm.head()

,Jmeno,Rocnik,Cas,Rok zavodu,Cas 2019,Zmena
1,Aster Vladimír,1965,2025-10-12 02:00:19,2020,2025-10-12 01:53:25,0 days 00:06:54
3,Asterová Jana,1974,2025-10-12 02:30:01,2020,2025-10-12 02:16:59,0 days 00:13:02
5,Baborová Anna,1990,2025-10-12 01:52:25,2020,2025-10-12 01:58:20,-1 days +23:54:05
7,Bambas Jan,1975,2025-10-12 02:35:39,2020,2025-10-12 02:02:59,0 days 00:32:40
9,Barochovská Andrea,1976,2025-10-12 02:50:05,2020,2025-10-12 03:01:25,-1 days +23:48:40

In [24]:
hm["Zmena"].mean()

Timedelta('0 days 00:09:36.031578947')

# Swing states
 Státy, kde se vítězné strany střídají
 Úkol: spočítat pro jeden konkrétní stát, kolikrát se v něm změnila vítězná politická strana

In [26]:
# Načte data z URL do DataFrame
data = pd.read_csv(
    "https://kodim.cz/cms/assets/czechitas/python-data-1/python-pro-data-1/datum-cas-shift/excs/swing-states/election-data.csv")
data.head()

,year,state,candidate,party_simplified,candidatevotes,rank
0,1976,ALABAMA,"CARTER, JIMMY",DEMOCRAT,659170,1.0
1,1976,ALABAMA,"FORD, GERALD",REPUBLICAN,504070,2.0
2,1976,ALABAMA,"MADDOX, LESTER",OTHER,9198,3.0
3,1976,ALABAMA,"BUBAR, BENJAMIN """"BEN""""",OTHER,6669,4.0
4,1976,ALABAMA,"HALL, GUS",OTHER,1954,5.0

In [37]:
data = data[(data["state"]=="ALABAMA")&(data["rank"]==1)].sort_values(by = "year")
data.head(4)

    year    state          candidate party_simplified  candidatevotes  rank
0   1976  ALABAMA      CARTER, JIMMY         DEMOCRAT          659170   1.0
7   1980  ALABAMA     REAGAN, RONALD       REPUBLICAN          654192   1.0
17  1984  ALABAMA     REAGAN, RONALD       REPUBLICAN          872849   1.0
24  1988  ALABAMA  BUSH, GEORGE H.W.       REPUBLICAN          815576   1.0

In [41]:
data['previous_winner_party'] = data["party_simplified"].shift(1)
data.head(4)

,year,state,candidate,party_simplified,candidatevotes,rank,previous_winner_party
0,1976,ALABAMA,"CARTER, JIMMY",DEMOCRAT,659170,1.0,None
7,1980,ALABAMA,"REAGAN, RONALD",REPUBLICAN,654192,1.0,DEMOCRAT
17,1984,ALABAMA,"REAGAN, RONALD",REPUBLICAN,872849,1.0,REPUBLICAN
24,1988,ALABAMA,"BUSH, GEORGE H.W.",REPUBLICAN,815576,1.0,REPUBLICAN

In [42]:
# Odstraní řádky s chybějícími daty (zejména první řádek, kde je 'previous_winner_party' NaN)
data = data.dropna()
data[data["party_simplified"] != data["previous_winner_party"]]

,year,state,candidate,party_simplified,candidatevotes,rank,previous_winner_party
7,1980,ALABAMA,"REAGAN, RONALD",REPUBLICAN,654192,1.0,DEMOCRAT